app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
      <% url = "/users/" + comment.user_id.to_s %>
      user:<a href=<%=url%>><%= User.find(comment.user_id).name %></a>