app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5 OFFSET 5
SELECT COUNT(*) FROM "posts"
---
  def index
    get_status
    @posts = Post.order('created_at DESC').page(params[:page]).per(5)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "taggings".* FROM "taggings" WHERE "conditions"."post_id" = '10'
SELECT "tags".* FROM "tags" WHERE "tags"."id" = 1 LIMIT 1
---
  def show
    get_status
    @post = Post.find(params[:id])
    @selected_tags = []
    @user = User.find(@post.user_id)
    @comments = Comment.where({:post_id => params[:id]})

    selected_taggings = Tagging.where({:post_id => params[:id]})

    selected_taggings.each do |tag|
      @selected_tags << Tag.where({:id => tag.tag_id}).first

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tags".* FROM "tags"
---
  def edit
    get_status
    @post = Post.find(params[:id])
    @select_tags = {}
    @new_tag_name = ""
    Tagging.search_post_taggings(params[:id]).each do |tagging|

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'sample
---
  def update
    if params[:commit] == "Preview !"
      preview
      @post.id = params[:post_id]

      render :action => "edit" and return
    end
    get_status
    post = Post.find(params[:post_id])
    save_post(post)
    respond_to do |format|
      if @post.update_attributes(params[:post])