app/controllers/tags_controller.rb

  def show
    get_status
    @tag = Tag.find(params[:id])
    taggings = Tagging.where(:tag_id => params[:id])

    post_ids = []
    taggings.each do |tagging|
      post_ids << tagging.post_id
    end
    post_ids.compact!

    @posts = Post.where(:id => post_ids).order('created_at DESC').page(params[:page]).per(5)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "taggings".* FROM "taggings" WHERE "taggings"."tag_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (6, 9, 10, 11, 13) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."id" IN (6, 9, 10, 11, 13)

  def create
    get_status
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 11 Jul 2013 05:50:51 UTC +00:00], ["name", "heroku"], ["updated_at", Thu, 11 Jul 2013 05:50:51 UTC +00:00]]