app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
  def show
  	get_status
  	@user = User.where(:id => params[:id]).first
    @posts = Post.where(:user_id => params[:id]).order('created_at DESC').page(params[:page]).per(5)